zephyrproject-rtos/zephyr/ext/hal/nxp/mcux/devices/MKW31Z4/MKW31Z4.xml
        <register>
          <name>RF_OSC_CTRL</name>
          <description>Radio Oscillator Control</description>
          <addressOffset>0x124</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x203806</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BB_XTAL_ALC_COUNT_SEL</name>
              <description>rmap_bb_xtal_alc_count_sel_hv[1:0]</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BB_XTAL_ALC_ON</name>
              <description>rmap_bb_xtal_alc_on_hv</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RF_OSC_BYPASS_EN</name>
              <description>RF Ref Osc Bypass Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BB_XTAL_COMP_BIAS</name>
              <description>rmap_bb_xtal_comp_bias_hv[4:0]</description>
              <bitOffset>4</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BB_XTAL_DC_COUP_MODE_EN</name>
              <description>rmap_bb_xtal_dc_coup_mode_en_hv</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BB_XTAL_DIAGSEL</name>
              <description>rmap_bb_xtal_diagsel_hv</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BB_XTAL_DIG_CLK_ON</name>
              <description>rmap_bb_xtal_dig_clk_on_hv</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BB_XTAL_GM</name>
              <description>rmap_bb_xtal_gm_hv[4:0]</description>
              <bitOffset>12</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BB_XTAL_ON_OVRD</name>
              <description>rmap_bb_xtal_on_ovrd_hv</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BB_XTAL_ON_OVRD_ON</name>
              <description>rmap_bb_xtal_on_ovrd_on_hv</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BB_XTAL_READY_COUNT_SEL</name>
              <description>rmap_bb_xtal_ready_count_sel_hv[1:0]</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RADIO_EXT_OSC_RF_EN_SEL</name>
              <description>Radio External Request for RF OSC Select</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RADIO_EXT_OSC_OVRD</name>
              <description>Radio External Request for RF OSC Override</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RADIO_EXT_OSC_OVRD_EN</name>
              <description>Radio External Request for RF OSC Override Enable</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RADIO_RF_ABORT_OVRD</name>
              <description>Radio RF Abort Override</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RADIO_RF_ABORT_OVRD_EN</name>
              <description>Radio RF Abort Override Enable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ANA_TEST</name>
          <description>Radio Analog Test Registers</description>
          <addressOffset>0x128</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BB_LDO_LS_BYP</name>
              <description>rmap_bb_ldo_ls_byp_hv</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BB_LDO_LS_DIAGSEL</name>
              <description>rmap_bb_ldo_ls_diagsel_hv</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BB_LDO_XO_BYP_ON</name>
              <description>rmap_bb_ldo_xo_byp_on_hv</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BB_LDO_XO_DIAGSEL</name>
              <description>rmap_bb_ldo_xo_diagsel_hv</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BB_XTAL_TEST</name>
              <description>rmap_bb_xtal_test_en_hv</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BG_DIAGBUF</name>
              <description>rmap_bg_diagbuf_hv</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BG_DIAGSEL</name>
              <description>rmap_bg_diagsel_hv</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BG_STARTUPFORCE</name>
              <description>rmap_bg_startupforce_hv</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DIAG_1234_ON</name>
              <description>rmap_diag_1234_on_hv</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DIAG2SOCADC_DEC</name>
              <description>rmap_diag2socadc_dec_hv[1:0]</description>
              <bitOffset>9</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DIAG2SOCADC_DEC_ON</name>
              <description>rmap_diag2socadc_dec_on_hv</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DIAGCODE</name>
              <description>rmap_diagcode_hv[2:0]</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ANA_TRIM</name>
          <description>Radio Analog Trim Registers</description>
          <addressOffset>0x12C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x784B0000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BB_LDO_LS_SPARE</name>
              <description>rmap_bb_ldo_ls_spare_hv[1:0]</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BB_LDO_LS_TRIM</name>
              <description>rmap_bb_ldo_ls_trim_hv[2:0]</description>
              <bitOffset>3</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BB_LDO_XO_SPARE</name>
              <description>rmap_bb_ldo_xo_spare_hv[1:0]</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BB_LDO_XO_TRIM</name>
              <description>rmap_bb_ldo_xo_trim_hv[2:0]</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BB_XTAL_SPARE</name>
              <description>rmap_bb_xtal_spare_hv[4:0]</description>
              <bitOffset>11</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BB_XTAL_TRIM</name>
              <description>rmap_bb_xtal_trim_hv[7:0]</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BG_1V_TRIM</name>
              <description>rmap_bg_1v_trim_hv[3:0]</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BG_IBIAS_5U_TRIM</name>
              <description>rmap_bg_ibias_5u_trim_hv[3:0]</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
