zephyrproject-rtos/zephyr/ext/hal/nxp/mcux/devices/MKW31Z4/MKW31Z4.xml
        <register>
          <name>TIMING13</name>
          <description>TSM_TIMING13</description>
          <addressOffset>0x64</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x16004A00</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SY_VCO_AUTOTUNE_EN_TX_HI</name>
              <description>Assertion time setting for SY_VCO_AUTOTUNE_EN (TX)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SY_VCO_AUTOTUNE_EN_TX_LO</name>
              <description>De-assertion time setting for SY_VCO_AUTOTUNE_EN (TX)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SY_VCO_AUTOTUNE_EN_RX_HI</name>
              <description>Assertion time setting for SY_VCO_AUTOTUNE_EN (RX)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SY_VCO_AUTOTUNE_EN_RX_LO</name>
              <description>De-assertion time setting for SY_VCO_AUTOTUNE_EN (RX)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMING14</name>
          <description>TSM_TIMING14</description>
          <addressOffset>0x68</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x672F645F</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SY_PD_CYCLE_SLIP_LD_FT_EN_TX_HI</name>
              <description>Assertion time setting for SY_PD_CYCLE_SLIP_LD_FT_EN (TX)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SY_PD_CYCLE_SLIP_LD_FT_EN_TX_LO</name>
              <description>De-assertion time setting for SY_PD_CYCLE_SLIP_LD_FT_EN (TX)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SY_PD_CYCLE_SLIP_LD_FT_EN_RX_HI</name>
              <description>Assertion time setting for SY_PD_CYCLE_SLIP_LD_FT_EN (RX)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SY_PD_CYCLE_SLIP_LD_FT_EN_RX_LO</name>
              <description>De-assertion time setting for SY_PD_CYCLE_SLIP_LD_FT_EN (RX)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMING15</name>
          <description>TSM_TIMING15</description>
          <addressOffset>0x6C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x67036A03</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SY_VCO_EN_TX_HI</name>
              <description>Assertion time setting for SY_VCO_EN (TX)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SY_VCO_EN_TX_LO</name>
              <description>De-assertion time setting for SY_VCO_EN (TX)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SY_VCO_EN_RX_HI</name>
              <description>Assertion time setting for SY_VCO_EN (RX)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SY_VCO_EN_RX_LO</name>
              <description>De-assertion time setting for SY_VCO_EN (RX)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMING16</name>
          <description>TSM_TIMING16</description>
          <addressOffset>0x70</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x671AFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SY_LO_RX_BUF_EN_RX_HI</name>
              <description>Assertion time setting for SY_LO_RX_BUF_EN (RX)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SY_LO_RX_BUF_EN_RX_LO</name>
              <description>De-assertion time setting for SY_LO_RX_BUF_EN (RX)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMING17</name>
          <description>TSM_TIMING17</description>
          <addressOffset>0x74</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFF6A5A</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SY_LO_TX_BUF_EN_TX_HI</name>
              <description>Assertion time setting for SY_LO_TX_BUF_EN (TX)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SY_LO_TX_BUF_EN_TX_LO</name>
              <description>De-assertion time setting for SY_LO_TX_BUF_EN (TX)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMING18</name>
          <description>TSM_TIMING18</description>
          <addressOffset>0x78</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x67056A05</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SY_DIVN_EN_TX_HI</name>
              <description>Assertion time setting for SY_DIVN_EN (TX)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SY_DIVN_EN_TX_LO</name>
              <description>De-assertion time setting for SY_DIVN_EN (TX)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SY_DIVN_EN_RX_HI</name>
              <description>Assertion time setting for SY_DIVN_EN (RX)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SY_DIVN_EN_RX_LO</name>
              <description>De-assertion time setting for SY_DIVN_EN (RX)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMING19</name>
          <description>TSM_TIMING19</description>
          <addressOffset>0x7C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x16054A05</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SY_PD_FILTER_CHARGE_EN_TX_HI</name>
              <description>Assertion time setting for SY_PD_FILTER_CHARGE_EN (TX)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SY_PD_FILTER_CHARGE_EN_TX_LO</name>
              <description>De-assertion time setting for SY_PD_FILTER_CHARGE_EN (TX)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SY_PD_FILTER_CHARGE_EN_RX_HI</name>
              <description>Assertion time setting for SY_PD_FILTER_CHARGE_EN (RX)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SY_PD_FILTER_CHARGE_EN_RX_LO</name>
              <description>De-assertion time setting for SY_PD_FILTER_CHARGE_EN (RX)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMING20</name>
          <description>TSM_TIMING20</description>
          <addressOffset>0x80</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x67056A05</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SY_PD_EN_TX_HI</name>
              <description>Assertion time setting for SY_PD_EN (TX)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SY_PD_EN_TX_LO</name>
              <description>De-assertion time setting for SY_PD_EN (TX)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SY_PD_EN_RX_HI</name>
              <description>Assertion time setting for SY_PD_EN (RX)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SY_PD_EN_RX_LO</name>
              <description>De-assertion time setting for SY_PD_EN (RX)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMING21</name>
          <description>TSM_TIMING21</description>
          <addressOffset>0x84</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x67046A04</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SY_LO_DIVN_EN_TX_HI</name>
              <description>Assertion time setting for SY_LO_DIVN_EN (TX)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SY_LO_DIVN_EN_TX_LO</name>
              <description>De-assertion time setting for SY_LO_DIVN_EN (TX)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SY_LO_DIVN_EN_RX_HI</name>
              <description>Assertion time setting for SY_LO_DIVN_EN (RX)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SY_LO_DIVN_EN_RX_LO</name>
              <description>De-assertion time setting for SY_LO_DIVN_EN (RX)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMING22</name>
          <description>TSM_TIMING22</description>
          <addressOffset>0x88</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x6704FFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SY_LO_RX_EN_RX_HI</name>
              <description>Assertion time setting for SY_LO_RX_EN (RX)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SY_LO_RX_EN_RX_LO</name>
              <description>De-assertion time setting for SY_LO_RX_EN (RX)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMING23</name>
          <description>TSM_TIMING23</description>
          <addressOffset>0x8C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFF6A04</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SY_LO_TX_EN_TX_HI</name>
              <description>Assertion time setting for SY_LO_TX_EN (TX)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SY_LO_TX_EN_TX_LO</name>
              <description>De-assertion time setting for SY_LO_TX_EN (TX)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMING24</name>
          <description>TSM_TIMING24</description>
          <addressOffset>0x90</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x16004A00</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SY_DIVN_CAL_EN_TX_HI</name>
              <description>Assertion time setting for SY_DIVN_CAL_EN (TX)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SY_DIVN_CAL_EN_TX_LO</name>
              <description>De-assertion time setting for SY_DIVN_CAL_EN (TX)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SY_DIVN_CAL_EN_RX_HI</name>
              <description>Assertion time setting for SY_DIVN_CAL_EN (RX)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SY_DIVN_CAL_EN_RX_LO</name>
              <description>De-assertion time setting for SY_DIVN_CAL_EN (RX)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMING25</name>
          <description>TSM_TIMING25</description>
          <addressOffset>0x94</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x671BFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RX_LNA_MIXER_EN_RX_HI</name>
              <description>Assertion time setting for RX_LNA_MIXER_EN (RX)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_LNA_MIXER_EN_RX_LO</name>
              <description>De-assertion time setting for RX_LNA_MIXER_EN (RX)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMING26</name>
          <description>TSM_TIMING26</description>
          <addressOffset>0x98</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFF6A5A</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TX_PA_EN_TX_HI</name>
              <description>Assertion time setting for TX_PA_EN (TX)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TX_PA_EN_TX_LO</name>
              <description>De-assertion time setting for TX_PA_EN (TX)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMING27</name>
          <description>TSM_TIMING27</description>
          <addressOffset>0x9C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x671EFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RX_ADC_I_Q_EN_RX_HI</name>
              <description>Assertion time setting for RX_ADC_I_Q_EN (RX)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_ADC_I_Q_EN_RX_LO</name>
              <description>De-assertion time setting for RX_ADC_I_Q_EN (RX)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMING28</name>
          <description>TSM_TIMING28</description>
          <addressOffset>0xA0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1F1EFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RX_ADC_RESET_EN_RX_HI</name>
              <description>Assertion time setting for RX_ADC_RESET_EN (RX)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_ADC_RESET_EN_RX_LO</name>
              <description>De-assertion time setting for RX_ADC_RESET_EN (RX)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMING29</name>
          <description>TSM_TIMING29</description>
          <addressOffset>0xA4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x671CFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RX_BBA_I_Q_EN_RX_HI</name>
              <description>Assertion time setting for RX_BBA_I_Q_EN (RX)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_BBA_I_Q_EN_RX_LO</name>
              <description>De-assertion time setting for RX_BBA_I_Q_EN (RX)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMING30</name>
          <description>TSM_TIMING30</description>
          <addressOffset>0xA8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x671EFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RX_BBA_PDET_EN_RX_HI</name>
              <description>Assertion time setting for RX_BBA_PDET_EN (RX)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_BBA_PDET_EN_RX_LO</name>
              <description>De-assertion time setting for RX_BBA_PDET_EN (RX)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMING31</name>
          <description>TSM_TIMING31</description>
          <addressOffset>0xAC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x671DFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RX_BBA_TZA_DCOC_EN_RX_HI</name>
              <description>Assertion time setting for RX_BBA_TZA_DCOC_EN (RX)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_BBA_TZA_DCOC_EN_RX_LO</name>
              <description>De-assertion time setting for RX_BBA_TZA_DCOC_EN (RX)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMING32</name>
          <description>TSM_TIMING32</description>
          <addressOffset>0xB0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x671BFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RX_TZA_I_Q_EN_RX_HI</name>
              <description>Assertion time setting for RX_TZA_I_Q_EN (RX)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_TZA_I_Q_EN_RX_LO</name>
              <description>De-assertion time setting for RX_TZA_I_Q_EN (RX)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
