zephyrproject-rtos/zephyr/ext/hal/nxp/mcux/devices/MKW31Z4/MKW31Z4.xml
        <register>
          <name>XCVR_CTRL</name>
          <description>TRANSCEIVER CONTROL</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x121200</resetValue>
          <resetMask>0x78FFFFFF</resetMask>
          <fields>
            <field>
              <name>SEQCMD</name>
              <description>Sequence Commands</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0x0</name>
                  <description>No Action</description>
                  <value>#0000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x1</name>
                  <description>TX Start Now</description>
                  <value>#0001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x2</name>
                  <description>TX Start @ T1 Timer Compare Match (EVENT_TMR = T1_CMP)</description>
                  <value>#0010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x3</name>
                  <description>TX Start @ T2 Timer Compare Match (EVENT_TMR = T2_CMP)</description>
                  <value>#0011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x4</name>
                  <description>TX Cancel -- Cancels pending TX events but do not abort a TX-in-progress</description>
                  <value>#0100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x5</name>
                  <description>RX Start Now</description>
                  <value>#0101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x6</name>
                  <description>RX Start @ T1 Timer Compare Match (EVENT_TMR = T1_CMP)</description>
                  <value>#0110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x7</name>
                  <description>RX Start @ T2 Timer Compare Match (EVENT_TMR = T2_CMP)</description>
                  <value>#0111</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x8</name>
                  <description>RX Stop @ T1 Timer Compare Match (EVENT_TMR = T1_CMP)</description>
                  <value>#1000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x9</name>
                  <description>RX Stop @ T2 Timer Compare Match (EVENT_TMR = T2_CMP)</description>
                  <value>#1001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0xA</name>
                  <description>RX Cancel -- Cancels pending RX events but do not abort a RX-in-progress</description>
                  <value>#1010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0xB</name>
                  <description>Abort All - Cancels all pending events and abort any sequence-in-progress</description>
                  <value>#1011</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TX_PKT_LENGTH</name>
              <description>Transmit Packet Length</description>
              <bitOffset>8</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_PKT_LENGTH</name>
              <description>Receive Packet Length</description>
              <bitOffset>16</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMDDEC_CS</name>
              <description>Command Decode</description>
              <bitOffset>24</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>XCVR_BUSY</name>
              <description>Transceiver Busy</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>IDLE</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>BUSY</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>XCVR_STS</name>
          <description>TRANSCEIVER STATUS</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF006000</resetMask>
          <fields>
            <field>
              <name>TX_START_T1_PEND</name>
              <description>TX T1 Start Pending Status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TX_START_T2_PEND</name>
              <description>TX T2 Start Pending Status</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TX_IN_WARMUP</name>
              <description>TX Warmup Status</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TX_IN_PROGRESS</name>
              <description>TX in Progress Status</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TX_IN_WARMDN</name>
              <description>TX Warmdown Status</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RX_START_T1_PEND</name>
              <description>RX T1 Start Pending Status</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RX_START_T2_PEND</name>
              <description>RX T2 Start Pending Status</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RX_STOP_T1_PEND</name>
              <description>RX T1 Stop Pending Status</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RX_STOP_T2_PEND</name>
              <description>RX T2 Start Pending Status</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RX_IN_WARMUP</name>
              <description>RX Warmup Status</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RX_IN_SEARCH</name>
              <description>RX Search Status</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RX_IN_PROGRESS</name>
              <description>RX in Progress Status</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RX_IN_WARMDN</name>
              <description>RX Warmdown Status</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CRC_VALID</name>
              <description>CRC Valid Indicator</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>CRC is not valid for RX packet.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>CRC is valid for RX packet.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RSSI</name>
              <description>Received Signal Stength Indicator</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>XCVR_CFG</name>
          <description>TRANSCEIVER CONFIGURATION</description>
          <addressOffset>0x1C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF0000FF</resetMask>
          <fields>
            <field>
              <name>TX_WHITEN_DIS</name>
              <description>TX Whitening Disable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_DEWHITEN_DIS</name>
              <description>RX De-Whitening Disable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SW_CRC_EN</name>
              <description>Software CRC Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PREAMBLE_SZ</name>
              <description>Preamble Size</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TX_WARMUP</name>
              <description>Transmit Warmup Time</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RX_WARMUP</name>
              <description>Receive Warmup Time</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CHANNEL_NUM</name>
          <description>CHANNEL NUMBER</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CHANNEL_NUM</name>
              <description>Channel Number</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TX_POWER</name>
          <description>TRANSMIT POWER</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TX_POWER</name>
              <description>Transmit Power</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>NTW_ADR_CTRL</name>
          <description>NETWORK ADDRESS CONTROL</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5500</resetValue>
          <resetMask>0xFFFFFF0F</resetMask>
          <fields>
            <field>
              <name>NTW_ADR_EN</name>
              <description>Network Address Match Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NTW_ADR_MCH</name>
              <description>Network Address Match Status</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>NTW_ADR0_SZ</name>
              <description>Network Address Match Size</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>1 octet</description>
                  <value>#00</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>2 octets</description>
                  <value>#01</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2</name>
                  <description>3 octets</description>
                  <value>#10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3</name>
                  <description>4 octets</description>
                  <value>#11</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NTW_ADR1_SZ</name>
              <description>Network Address Match Size</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>1 octet</description>
                  <value>#00</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>2 octets</description>
                  <value>#01</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2</name>
                  <description>3 octets</description>
                  <value>#10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3</name>
                  <description>4 octets</description>
                  <value>#11</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NTW_ADR2_SZ</name>
              <description>Network Address Match Size</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>1 octet</description>
                  <value>#00</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>2 octets</description>
                  <value>#01</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2</name>
                  <description>3 octets</description>
                  <value>#10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3</name>
                  <description>4 octets</description>
                  <value>#11</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NTW_ADR3_SZ</name>
              <description>Network Address Match Size</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>1 octet</description>
                  <value>#00</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>2 octets</description>
                  <value>#01</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2</name>
                  <description>3 octets</description>
                  <value>#10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3</name>
                  <description>4 octets</description>
                  <value>#11</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NTW_ADR_THR0</name>
              <description>Network Address Match Bit Error Threshold 0</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NTW_ADR_THR1</name>
              <description>Network Address Match Bit Error Threshold 1</description>
              <bitOffset>20</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NTW_ADR_THR2</name>
              <description>Network Address Match Bit Error Threshold 2</description>
              <bitOffset>24</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NTW_ADR_THR3</name>
              <description>Network Address Match Bit Error Threshold 3</description>
              <bitOffset>28</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>NTW_ADR_0</name>
          <description>NETWORK ADDRESS 0</description>
          <addressOffset>0x2C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x55555555</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>NTW_ADR_0</name>
              <description>Network Address 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>NTW_ADR_1</name>
          <description>NETWORK ADDRESS 1</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x55555555</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>NTW_ADR_1</name>
              <description>Network Address 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>NTW_ADR_2</name>
          <description>NETWORK ADDRESS 2</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x55555555</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>NTW_ADR_2</name>
              <description>Network Address 2</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>NTW_ADR_3</name>
          <description>NETWORK ADDRESS 3</description>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x55555555</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>NTW_ADR_3</name>
              <description>Network Address 2</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RX_WATERMARK</name>
          <description>RX WATERMARK</description>
          <addressOffset>0x3C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x7F</resetValue>
          <resetMask>0xFF80FFFF</resetMask>
          <fields>
            <field>
              <name>RX_WATERMARK</name>
              <description>RX Watermark</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BYTE_COUNTER</name>
              <description>Byte Counter</description>
              <bitOffset>16</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>First Byte of Network Address</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Second Byte of Network Address</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DSM_CTRL</name>
          <description>DSM CONTROL</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFE</resetMask>
          <fields>
            <field>
              <name>ANT_SLEEP_EN</name>
              <description>ANT DSM Sleep Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
